{"modelTopology":{"class_name":"Model","config":{"name":"model9","layers":[{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization33","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization33","trainable":true},"inbound_nodes":[[["input9",0,0,{}]]]},{"name":"dense_Dense33","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization33",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization34","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization34","trainable":true},"inbound_nodes":[[["dense_Dense33",0,0,{}]]]},{"name":"dense_Dense34","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization34",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization35","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization35","trainable":true},"inbound_nodes":[[["dense_Dense34",0,0,{}]]]},{"name":"dense_Dense35","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization35",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization36","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization36","trainable":true},"inbound_nodes":[[["dense_Dense35",0,0,{}]]]},{"name":"dense_Dense36","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization36",0,0,{}]]]}],"input_layers":[["input9",0,0]],"output_layers":[["dense_Dense36",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization33/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization33/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense33/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization34/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization34/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization35/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization35/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense35/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization36/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization36/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense36/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense36/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization33/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization33/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization34/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization34/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization35/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization35/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization36/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization36/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}