{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,150,5],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"simple_rnn_SimpleRNN2","class_name":"SimpleRNN","config":{"name":"simple_rnn_SimpleRNN2","trainable":true,"units":256,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["simple_rnn_SimpleRNN2",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["dense_Dense2",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"simple_rnn_SimpleRNN2/kernel","shape":[5,256],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN2/recurrent_kernel","shape":[256,256],"dtype":"float32"},{"name":"simple_rnn_SimpleRNN2/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[256,5],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[5],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}