{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization21","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization21","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization21",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization22","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization22","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization22",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization23","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization23","trainable":true},"inbound_nodes":[[["dense_Dense22",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization23",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization24","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization24","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization24",0,0,{}]]]}],"input_layers":[["input6",0,0]],"output_layers":[["dense_Dense24",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization21/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}