{"modelTopology":{"class_name":"Model","config":{"name":"model8","layers":[{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization29","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization29","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization29",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization30","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization30","trainable":true},"inbound_nodes":[[["dense_Dense29",0,0,{}]]]},{"name":"dense_Dense30","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization30",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization31","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization31","trainable":true},"inbound_nodes":[[["dense_Dense30",0,0,{}]]]},{"name":"dense_Dense31","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization31",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization32","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization32","trainable":true},"inbound_nodes":[[["dense_Dense31",0,0,{}]]]},{"name":"dense_Dense32","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization32",0,0,{}]]]}],"input_layers":[["input8",0,0]],"output_layers":[["dense_Dense32",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization29/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization29/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization30/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization30/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense30/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization31/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization31/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense31/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense31/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization32/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization32/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense32/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense32/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization29/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization29/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization30/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization30/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization31/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization31/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization32/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization32/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}