{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization13","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization14","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true},"inbound_nodes":[[["dense_Dense13",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization14",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization15","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization15","trainable":true},"inbound_nodes":[[["dense_Dense14",0,0,{}]]]},{"name":"dense_Dense15","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization16","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization16","trainable":true},"inbound_nodes":[[["dense_Dense15",0,0,{}]]]},{"name":"dense_Dense16","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization16",0,0,{}]]]}],"input_layers":[["input4",0,0]],"output_layers":[["dense_Dense16",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization13/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense15/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense15/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}