{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization9","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization9","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization9",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization10","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization10","trainable":true},"inbound_nodes":[[["dense_Dense9",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization10",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization11","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization11","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization11",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization12","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization12","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization12",0,0,{}]]]}],"input_layers":[["input3",0,0]],"output_layers":[["dense_Dense12",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization9/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}