{"modelTopology":{"class_name":"Model","config":{"name":"model7","layers":[{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization25","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization25","trainable":true},"inbound_nodes":[[["input7",0,0,{}]]]},{"name":"dense_Dense25","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization25",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization26","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization26","trainable":true},"inbound_nodes":[[["dense_Dense25",0,0,{}]]]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization26",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization27","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization27","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization27",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization28","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization28","trainable":true},"inbound_nodes":[[["dense_Dense27",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization28",0,0,{}]]]}],"input_layers":[["input7",0,0]],"output_layers":[["dense_Dense28",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization25/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization25/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization26/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization26/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization27/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization27/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization28/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization28/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization25/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization25/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization26/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization26/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization27/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization27/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization28/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization28/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}