{"modelTopology":{"class_name":"Model","config":{"name":"model10","layers":[{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization37","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization37","trainable":true},"inbound_nodes":[[["input10",0,0,{}]]]},{"name":"dense_Dense37","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense37","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization37",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization38","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization38","trainable":true},"inbound_nodes":[[["dense_Dense37",0,0,{}]]]},{"name":"dense_Dense38","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense38","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization38",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization39","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization39","trainable":true},"inbound_nodes":[[["dense_Dense38",0,0,{}]]]},{"name":"dense_Dense39","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense39","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization39",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization40","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization40","trainable":true},"inbound_nodes":[[["dense_Dense39",0,0,{}]]]},{"name":"dense_Dense40","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization40",0,0,{}]]]}],"input_layers":[["input10",0,0]],"output_layers":[["dense_Dense40",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization37/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense37/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense37/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense38/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense38/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense39/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense39/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense40/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense40/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}