{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,5],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization17","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization17","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"dense_Dense17","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense17","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization18","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization18","trainable":true},"inbound_nodes":[[["dense_Dense17",0,0,{}]]]},{"name":"dense_Dense18","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense18","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization18",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization19","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization19","trainable":true},"inbound_nodes":[[["dense_Dense18",0,0,{}]]]},{"name":"dense_Dense19","class_name":"Dense","config":{"units":16,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization19",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization20","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization20","trainable":true},"inbound_nodes":[[["dense_Dense19",0,0,{}]]]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization20",0,0,{}]]]}],"input_layers":[["input5",0,0]],"output_layers":[["dense_Dense20",0,0]]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"batch_normalization_BatchNormalization17/gamma","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/beta","shape":[5],"dtype":"float32"},{"name":"dense_Dense17/kernel","shape":[5,128],"dtype":"float32"},{"name":"dense_Dense17/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/beta","shape":[128],"dtype":"float32"},{"name":"dense_Dense18/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense18/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense19/kernel","shape":[64,16],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/beta","shape":[16],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[16,1],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_mean","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_variance","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_variance","shape":[16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}